{"content": {"Introduction": {"para_sentences": {"para_0": "You will hear the word ‘asymptotic’ very often when studying any text on algorithms. The dictionary defines ‘asymptotic’ as the behavior of a line as it approaches a curve but never touches. In analyzing the efficiency of an algorithm, we are concerned with how its running time increases as the size of the input increases without bound. To compare efficiency computer scientists use three notations: O (big oh), Ω (big omega), and Θ (big theta).", "para_1": "In this section, we will define these asymptotic notations (MLO2) and use them with non-recursive algorithms.", "para_2": "In the following reading, T(n) and g(n) can be any nonnegative functions defined on positive integers.", "para_3": "T(n) will be the algorithm’s running time.", "para_4": "g(n) will be some simple function that will be used to compare T(n) with."}, "li_sentences": {}}, "O Notation (Big O)": {"para_sentences": {"para_0": "Informally, O(g(n)) is a set of all functions with a lower or same order of growth as g(n) (within a constant multiple, as n goes to infinity).", "para_1": "we say a function T(n) “is O(g(n))” if T(n) ∈ O(g(n)).", "para_2": "For example: ", "para_3": "A function T(n) is said to be in O(g(n)), denoted by T(n) ∈ O(g(n)), if T(n) ≤ c(g(n)) for all n ≥ n0, for some positive constant c.", "para_4": "Let us prove 5n + 100 ∈ O(n2). ", "para_5": "To prove this we have to play around the expression and select the values of c and n0. ", "para_6": "Here g(n)=n2, f(n)=5n+100.", "para_7": "To prove big O, we want to get f(n) ≤ cg(n); for this let us try to get n2 term into the equation while maintaining ≤ inequality. How about use the terms ( 5 and 100) from f(n) along with n2 as shown below.", "para_8": "It is true that, 5n + 100 ≤  5n2 + 100n2 ( this inequality is true for all n ≥ 1)", "para_9": "                ⟹ 5n + 100 ≤ 105n2 (for all n ≥ 1)", "para_10": "We got the equations in the form of  f(n) ≤ cg(n). So, we can select c = 105 and n0= 1", "para_11": "Note that this is not the only solution, you can solve it in different ways.", "para_12": "The below video explains another example. As you watch it observe the process that is being followed to obtain cg(n) from f(n) terms.", "para_13": "Access video notes here\n\n\nActions\n\n\nPreview\nDownload\nAlternative formats\n\n.", "para_14": "   ", "para_15": "Try the below question by yourself before you see the answer.", "para_16": "Prove that 3n2 + 10n ∈ O(n2). Try this yourself before looking at the solution.", "para_17": " ", "para_18": " "}, "li_sentences": {"ol_0": ["n ∈ O(n2) and  5n+100 ∈ O(n2) Here n is a linear function hence it has a lower order of growth than g(n) = n2", "3n(n-1) ∈ O(n2) Here 3n(n-1) is a quadratic function and it has the same order of growth as n2", "But 3n(n-1) ∉ O(n) Here 3n(n-1) has a higher order of growth compared to n"]}}, "Ω Notation (Omega)": {"para_sentences": {"para_0": "Informally, Ω(g(n)) is a set of all functions with a higher or same order of growth as g(n) (within a constant multiple, as n goes to infinity).", "para_1": "we say a function T(n) “is Ω(g(n))” if T(n) ∈ Ω(g(n)).", "para_2": "A function T(n) is said to be in Ω(g(n)), denoted by T(n) ∈ Ω(g(n)), if T(n) ≥ c(g(n)) for all n ≥ n0 , for some positive constant c.", "para_3": "Let us prove 5n2 is Ω(n)", "para_4": "To prove this we have to select the values of c and n0. Similar to Big-O proof we will use the terms in f(n) to build the relation between f(n) and g(n).", "para_5": "              5n2  ≥ 5n  for all n ≥ 1 (obvious)", "para_6": "We can select c = 5, n0 =1", "para_7": "The below video explains another example. Access video notes here\n\n\nActions\n\n\nPreview\nDownload\nAlternative formats\n\n.", "para_8": " ", "para_9": "Try the following question by yourself before you see the answer.", "para_10": "Prove 2n3 - 7n +1 ∈ Ω(n3). Try this yourself before looking at the solution. "}, "li_sentences": {}}}, "heading_sentences": ["Exploration 1", "2: Asymptotic Notations"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ol_0": [[]]}, "preh2_links": {}}