{"content": {"Introduction": {"para_sentences": {"para_0": "In this section, we see how to solve the recurrence relation using the substitution method (MLO2)."}, "li_sentences": {}}, "Substitution Method": {"para_sentences": {"para_0": "The idea behind the substitution method is that we want to solve the recurrence relation by substituting the smaller values of the recurrence relation in the equation. For example, if the recurrence relation has T(n/2) we will find the equation of T(n/2) from T(n) and substitute it back in the recurrence relation. We will go on doing this until we reach the base case, where the recurrence stops.", "para_1": " Let's try to solve the below recurrence relation. For a better learning experience, try to follow the steps using a pen and paper.", "para_2": "", "para_3": "First, we will take the expression of T(n)", "para_4": "", "para_5": "We have to substitute the value of T(n/2) in terms of its smaller values.", "para_6": "Substituting   in Eq1, we get", "para_7": "", "para_8": "", "para_9": "Substituting  in Eq1", "para_10": "", "para_11": "", "para_12": "To solve this further we need to substitute  in Eq2.", "para_13": "To find , substitute   in Eq1. We get,", "para_14": "", "para_15": "Substituting  in Eq2, we get:", "para_16": "", "para_17": "Do you notice a pattern of how numbers are increasing in the equation?", "para_18": "T(n) equation was Eq1:  ", "para_19": "Eq2 can be written as:  ", "para_20": "Eq3 can be written as: ", "para_21": "We will go on substituting the smaller values of T on the right-hand side of the equation until we reach the base case, i.e. when the recurrence terminates, which is T(1) here.", "para_22": "Let's say at kth equation we reach the base case. By observing the pattern of Eq1,2,3, we can write our kth equation as,", "para_23": "", "para_24": "Since we arrived at the base case (T(1)) in the kth equation, we can say ", "para_25": "Substituting  in the   modifies as: ", "para_26": "From the base case, we know, ", "para_27": "", "para_28": "Substituting this in our modified kth equation: ", "para_29": "Now, our equation does not have any smaller T(n) terms in this equation. ", "para_30": "We just need to get rid of k by expressing it in terms of n. ", "para_31": "From our  we can say ", "para_32": "", "para_33": " (Applying Log2 on both sides)", "para_34": "", "para_35": "(since, Log22 = 1)", "para_36": "", "para_37": "Substituting this for the value of k in the kth equation: ", "para_38": "Viola, we solved our T(n).", "para_39": "Our final solved equation for T(n),", "para_40": " , where c1 and c are some constants.", "para_41": "Now from the previous knowledge of asymptotic analysis can you tell the time complexity of T(n)? Since, the highest order term is  , time complexity will be Θ(log n). ", "para_42": "We will skip mentioning the base of the log since most of the times we will be dealing with the logarithmic notation of base 2. If that is not the case we will write it.", "para_43": "Let's revisit what we just did, we took our recurrence relation T(n) and substituted the smaller values of itself  by using the T(n) equation. After a couple of substitutions, we could find the pattern of how the equation is changing with each substitution. Using this pattern we wrote the equation for the kth substitution, where our recurrence relation reaches the base case. Then, we used the base case equation to solve for the value of k. Hence, we obtained our T(n) purely in terms of n, devoid of any k's or smaller values of T(n). Using this solved recurrence equation we could tell the time complexity.", "para_44": "The below video explains how to solve the following recursive equation that we saw in the previous exploration.", "para_45": "", "para_46": "If you want, you can attempt it by yourself before watching the explanation in the video. Access video notes here\n\n\nActions\n\n\nPreview\nDownload\nAlternative formats\n\n.", "para_47": " "}, "li_sentences": {}}, "Exercises": {"para_sentences": {"para_0": " "}, "li_sentences": {}}}, "heading_sentences": ["Exploration 2", "2", "1: Substitution Method"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {}, "preh2_links": {}}