{"content": {"Introduction": {"para_sentences": {"para_0": "In this module, we'll talk about implementing a recursive algorithm (CLO4). We will look at the techniques to solve recurrence relations (CLO3), this will help us analyze the time complexity of recursive algorithms.", "para_1": "Then we will look at a commonly used strategy of solving recursive algorithms called 'Divide and Conquer'. Divide and conquer is a very popular algorithmic paradigm, once you have mastered this you will able to reduce the time complexity of various algorithmic problems drastically and write efficient programs. At the end of the module, you will be able to implement algorithms using the divide-and-conquer technique (CLO5).", "para_2": " ", "para_3": ""}, "li_sentences": {}}, "Module Learning Outcomes": {"para_sentences": {"para_0": "After successful completion of this module, you should be able to do the following (in addition to answering the questions listed below):"}, "li_sentences": {"ol_0": ["Implement a recursive algorithm (CLO4)  When to use recursion? What is the recursion template?", "When to use recursion?", "What is the recursion template?", "Solve simple recurrence relations (CLO3)  What is a recurrence relation? What are the three methods of solving a recurrence relation? What is a recursion tree? What is the master method?", "What is a recurrence relation?", "What are the three methods of solving a recurrence relation?", "What is a recursion tree?", "What is the master method?", "Implement a divide-and-conquer algorithm (CLO5)  What is a divide-and-conquer strategy? How to solve a problem using the divide-and-conquer strategy?", "What is a divide-and-conquer strategy?", "How to solve a problem using the divide-and-conquer strategy?"]}}, "Explorations": {"para_sentences": {"para_0": "Use the pages within this module to explore the following concepts:"}, "li_sentences": {"ul_0": ["Recursion", "Recurrence Relations", "Substitution Method", "Recursion-Tree Method", "The Master Method", "Divide-and-Conquer Technique", "Divide-and-Conquer Algorithms"]}}, "Task List": {"para_sentences": {"para_0": "Please make sure to complete the following assignments and other tasks:", "para_1": "", "para_2": "Banner Art: Pixabay\n\n\nLinks to an external site."}, "li_sentences": {"ul_0": ["View the explorations", "Complete the recommended but optional activities within the exploration pages", "Quiz - Recursion  Recurrence Relations and Divide & Conquer", "Homework: Recursion  Recurrence Relations and Divide & Conquer"]}}}, "heading_sentences": ["Week 2 - Overview"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ol_0": [[]], "ul_0": [[]]}, "preh2_links": {}}