{"content": {"Input Function": {"para_sentences": {"para_0": "The input() function reads typed input from the user. You can use it in a couple of ways. For example, if you want to ask the user for their name, you can do this:", "para_1": "Or you can do this:", "para_2": "Notice that with the first way, your input will appear on the line after the prompt, and with the second way, your input would appear on the same line as the prompt.", "para_3": "User input is always a string. If you want a numeric value from user input, then you need to cast the string to an int or a float.", "para_4": "Each of the lines above combines two functions. First the input function gets a string from the user. Next the int() or float() function casts that string to a numeric value. That value is then assigned to the variable. We can call those functions on separate lines if we want:", "para_5": "If the user enters a string that cannot be cast to the specified type, that causes an error. For example, if for height in meters we try to enter \"hi\", what happens?", "para_6": " ", "para_7": "Here's an example that asks the user for two numbers and prints out their sum:", "para_8": "You can also cast an int to a float:", "para_9": "Or a float to an int, which truncates everything after the decimal point:", "para_10": "You can also cast values to strings with str()."}, "li_sentences": {}}, "Exercises": {"para_sentences": {"para_0": "(See the module overview for a link to example solutions.)", "para_1": "1. Write code that asks the user for their name and then prints out \"Hello\" followed by their name.", "para_2": "2. Write code that asks the user for two numbers and then prints out \"The result is\" followed by the result of multiplying those numbers.", "para_3": "3. Same as #2, but first store the result of multiplication in a variable and then use that variable when printing out the result."}, "li_sentences": {}}}, "heading_sentences": ["Exploration: Input & Casting"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {}, "preh2_links": {}}