{"content": {"Comparison operators": {"para_sentences": {"para_0": "We often need to compare two values. Python has the following comparison operators:", "para_1": "Each of the above conditions is either True or False, so if you print out the type of the comparison, you'll see that it's a bool. For example:", "para_2": "Don't mix up the assignment operator (=) and the equality operator (==). It's a common mistake that can be hard to see.", "para_3": "You shouldn't test two floats for exact equality because of possible lack of precision or round-off errors.  Instead, if you need to compare float values for equality, you can do it like this:", "para_4": "This takes the absolute value of the difference between the two numbers and checks whether it's less than a very small value.  In this course, whenever an assignment requires you to compute a float value, your result will not be tested for exact equality to the expected result - just for equality to within 7 decimal places.", "para_5": "Unlike many computer languages, Python allows you to chain comparison operators.  In Python you check if x is between 2 and 7 by saying", "para_6": "whereas in most languages you would need to write that as", "para_7": "The logical operator and is discussed in the following section."}, "li_sentences": {}}, "Logical operators": {"para_sentences": {"para_0": "Sometimes we need to combine comparisons. Python has the following logical operators:", "para_1": "Each of these conditions is also either True or False.", "para_2": "Assume that P and Q represent two conditions. P and Q is only true if P is true and Q is true. P or Q is true if either P is true or Q is true (or both). The not operator just flips the value from true to false or vice-versa.  So if P is false, then not P is true, but if P is true, then not P is false.", "para_3": "To check if num_x and num_y are both equal to 5, it is not correct to do the following:", "para_4": "since that would check whether x is True and y==5 is True.  Instead, you would need to do this:", "para_5": "or since we know we can chain comparisons:"}, "li_sentences": {}}, "Exercises": {"para_sentences": {"para_0": "(See the module overview for a link to example solutions.)", "para_1": "1. Print the value of 17 < 5.", "para_2": "2. Write code that reads a number from the user, assigns it to a variable, and then prints True if that value is greater than 10, but prints False otherwise.", "para_3": "3. Write code that reads a number from the user, assigns it to a variable, and then prints True if that value is between 50 and 100 (inclusive), but prints False otherwise."}, "li_sentences": {}}}, "heading_sentences": ["Exploration: Comparison operators and logical operators"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"para_0": [0, 0, 0], "para_1": [0, 0, 0], "para_2": [0, 0, 0], "para_3": [0, 0, 0], "para_4": [0, 0], "para_5": [0, 0], "para_6": [0], "para_7": [0]}, "preh2_links": {}}