{"content": {"if statements": {"para_sentences": {"para_0": "The if statement enables us to define branches in our code based on whether a given condition is true or false. Here's a simple example:", "para_1": "", "para_2": "The else case is optional. Both the if and else cases can contain as many statements as needed:", "para_3": "", "para_4": "The indentation matters for the program to run correctly. In any computer language indentation is very important for readability, but in most it doesn't affect how the computer executes a program. In Python it's what determines how statements are grouped together. The Python language doesn't force you to indent a specific number of spaces, but it's recommended that you indent 4 spaces unless you're adding to existing code that used something different.", "para_5": "You can also have nested if statements (if statements inside other if statements):", "para_6": "", "para_7": "The indentation tells the Python interpreter which ifs and elses go together, however, this level of nesting can get a little hard to read, so the more usual way to express this example would be:", "para_8": "", "para_9": "Where \"elif\" is short for \"else if\"."}, "li_sentences": {}}, "Exercises": {"para_sentences": {"para_0": "(See the module overview for a link to example solutions.)", "para_1": "1. Write code that reads a number from the user, assigns it to a variable, and then prints \"in range\" if that value is between 50 and 100, but prints \"out of range\" otherwise.", "para_2": "2. Write code that reads a number from the user, assigns it to a variable, and then prints \"small\" if it's less than 10, prints \"medium\" if it's at least 10 but less than 50, and prints \"large\" if it's at least 50.", "para_3": "3. Write code that reads an integer from the user and assigns it to a variable. If that integer is a value from 1-5, your program should print out the English word for that number. Otherwise it should print \"input not recognized\"."}, "li_sentences": {}}}, "heading_sentences": ["Exploration: If statements"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"para_0": [0, 0], "para_1": [0, 0], "para_2": [0, 0], "para_3": [0, 0], "para_4": [0], "para_5": [0], "para_6": [0], "para_7": [0], "para_8": [0], "para_9": [0]}, "preh2_links": {}}