{"content": {"Comments": {"para_sentences": {"para_0": "Comments are notes for those reading the code, and are ignored by the Python interpreter. A comment begins with #. A comment can be either on its own line or on the same line as other code. Either way, the compiler ignores everything between the # and the end of the line.", "para_1": "You should write comments that explain non-obvious aspects of your code, such as the purpose of a particular section, the units for the value of some variable, the reason for a certain design choice, etc. You certainly don't need to comment every line, but keep in mind that how your code works may not be obvious to other people, or even to yourself in a few months."}, "li_sentences": {}}, "Arithmetic": {"para_sentences": {"para_0": "Addition, subtraction, multiplication and division are done with the +, -, *, and / symbols.", "para_1": "The floor division operation is done with the // symbol, and gives you the rounded down result of division.", "para_2": "Normal division results in a float value, even if the result is an integer.  For example 8 / 4 would give you 2.0.  If you need an integer remainder, use floor division.", "para_3": "The mod operation is done with the % symbol, and gives you the remainder of division.", "para_4": "Exponentiation is done with the ** symbol.", "para_5": "The order of operations is exponentiation, followed by multiplication, division, floor, and mod, followed by addition and subtraction. However parentheses can be used to give whatever order is needed, since operations in parentheses happen first.", "para_6": "The += operator is a slightly shorter way to express that you want to add something to an existing value. The following statements do exactly the same thing:", "para_7": "You can combine = with each of the operators above to get the following shortcut operators. See for yourself by typing in the following examples and then checking the value of 'num'.", "para_8": "The += operator is the most commonly used of these, since it's handy for accumulating totals.", "para_9": "You can get the absolute value of a number like this:", "para_10": "In the above line, the variable answer is assigned the value 12."}, "li_sentences": {}}, "Concatenation": {"para_sentences": {"para_0": "The + operator can also be used with strings to concatenate them together."}, "li_sentences": {}}, "Exercises": {"para_sentences": {"para_0": "(See the module overview for a link to example solutions.)", "para_1": "1. Write a statement that prints out the remainder of 19 divided by 6.", "para_2": "2. Write a statement that prints out 2 to the 4th power.", "para_3": "3. Write a statement that finds the result of 9 divided by 5 and assigns it to a variable named conversion_ratio.", "para_4": "4. Write code that first assigns 9 to a variable called num_planets, then subtracts 1 from it, so that num_planets will now equal 8.", "para_5": "5. Write code that assigns \"Doctor\" to a variable named title, assigns \"Pierce\" to a variable called last_name, and then uses string concatenation to print out \"Doctor Pierce\"."}, "li_sentences": {}}}, "heading_sentences": ["Exploration: Comments  Arithmetic & String Concatenation"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {}, "preh2_links": {}}