{"content": {" ": {"para_sentences": {"para_0": "Adapted from John Dalbey, Bob Roggio and Farshad Barahimi (CS 165).", "para_1": "Pseudocode and flowcharts allow the designer to focus on the logic of the algorithm without being distracted by details of language syntax. At the same time, the pseudocode or flowchart needs to be complete. It describes the entire logic of the algorithm so that implementation becomes a matter of translating from the pseudocode or flowchart into source code."}, "li_sentences": {}}, "Pseudocode": {"para_sentences": {"para_0": "In general the vocabulary used in the pseudocode should be the vocabulary of the problem domain, not of the implementation domain. The pseudocode is a narrative for someone who knows the requirements (problem domain) and is trying to learn how the solution can be organized. That is, someone who is a non-programmer should be able to read and understand your pseudocode. For example:", "para_1": "Extract the next word from the line (good) Set word to get next token (poor)", "para_2": "Append the file extension to the name (good) Name = name + extension (poor)", "para_3": "For every character in the name (good) For character = first to last (poor)", "para_4": "Note that the logic must be decomposed to the level of a single loop or decision. Thus \"Search the list and find the customer with highest balance\" is too vague because it takes a loop and a nested decision to implement it.", "para_5": "Each textbook and each individual designer may have their own personal style of pseudocode. Pseudocode is not a rigorous notation, since it is read by other people, not by the computer, but this is the style you should follow for this class.", "para_6": "Get student's grade from user", "para_7": "If student's grade >= 60", "para_8": "Print \"passed\"", "para_9": "else", "para_10": "Print \"failed\"", "para_11": "Set total to 0", "para_12": "Set grade counter to 1", "para_13": "While grade counter <= 10", "para_14": "Input the next grade", "para_15": "Add the grade to the total", "para_16": "Add 1 to the grade counter", "para_17": "Set the class average to the total divided by 10", "para_18": "Print the class average"}, "li_sentences": {}}, "Flowcharts": {"para_sentences": {"para_0": "A flowchart depicts an algorithm in a graphical format. Here are descriptions of the most common symbols:", "para_1": "", "para_2": ""}, "li_sentences": {"ul_0": ["Oval: start and end", "Arrow: represents flow of control in a program", "Rectangles: shows a computation or a specific process  for example \"multiply X by 2\"", "Parallelogram: Used for getting input from user or sending output to user", "Diamond: Used for conditional flow control where a program has to decide which way to go  for example: if X is divisible by 2 do this thing; if not  do this other thing"]}}}, "heading_sentences": ["Pseudocode and flowchart guidelines"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ul_0": [[]]}, "preh2_links": {}}