{"content": {"Tinker Lab": {"para_sentences": {"para_0": "What does the following code do?", "para_1": "", "para_2": "The code uses the formula P′=P(1+rn)nt. What does the * operator do? What does the ** operator do?", "para_3": "On line 8, the + operator performs addition, but what does it do on line 9? What determines which way that operator will behave?", "para_4": "Why do we need parentheses in line 8?", "para_5": "The variable name num isn't very descriptive. Can you think of a better name? Try renaming that variable (you'll need to rename it everywhere that it's used).", "para_6": "What do you think a variable does?", "para_7": "What does the = operator do?", "para_8": "What does line 5 do? What is the significance of the # operator?", "para_9": "What happens if on line 6 you replace float with int? Why is int used on line 8?", "para_10": "Modify the code so that it calculates the amount at the end of 10 years instead of 6.", "para_11": "Now try changing it so that it asks for the number of years and plugs that into the formula instead of always using the same number. Constants (values that don't change) are given names in all caps, but variables are given names in lower case.", "para_12": "It's possible to format the number of decimal places shown, but we won't worry about that in this course.", "para_13": " ", "para_14": "Here's another version of the first program:", "para_15": "", "para_16": "Note that there are usually multiple ways to accomplish the same task. Sometimes an approach is preferable for performance reasons, sometimes for style reasons, and sometimes it just comes down to personal preference. In this case, the differences fall into that third category.", "para_17": " ", "para_18": "What does the following code do?", "para_19": "", "para_20": " ", "para_21": "What does the following code do?", "para_22": "", "para_23": "Change the last line of code so that instead of having gems left over, they're given to adventurers until there are none left, so the output would be something like \"3 adventurers get 7 gems and 2 adventurers get 8 gems.\""}, "li_sentences": {"ul_0": ["What are two things that are done differently in this version?", "The behavior of this version is almost exactly the same  but there's a very small difference - what is it?"], "ul_1": ["What do you think type means in Python?", "What's happening on lines 3  4  6  and 8 (that isn't happening on the other lines)?"], "ul_2": ["What does the // operator do?", "What does the % operator do?"]}}}, "heading_sentences": ["Additional examples for Module 2"], "__pre_h2__": {"pre_h2_para_sentences": {"para_0": ""}, "pre_h2_li_sentences": {}}, "content_links": {"para_0": [0], "para_1": [0], "para_2": [0], "para_3": [0], "para_4": [0], "para_5": [0], "para_6": [0], "para_7": [0], "para_8": [0], "para_9": [0], "para_10": [0], "para_11": [0], "para_12": [0], "para_13": [0], "para_14": [0], "para_15": [0], "ul_0": [[0]], "para_16": [0], "para_17": [0], "para_18": [0], "para_19": [0], "ul_1": [[0]], "para_20": [0], "para_21": [0], "para_22": [0], "ul_2": [[0]], "para_23": [0]}, "preh2_links": {"para_0": [0]}}