{"content": {"Getting Started": {"para_sentences": {"para_0": "To participate in this assignment, you will need to go to the Groups section of this course. To do that, click on People in the menu on the left. Once on the People page, click on Groups. You should be able to see groups titled Homework 4 group followed by a number. You need to sign up to one of these groups (you'll need to scroll down past the groups for the previous assignment if there is any).  Do not create some other group. Size of each group should be no more than five.", "para_1": "Within your group there are different tools available - you must use your group's Files, Discussions and Collaborations tools for communicating and collaborating with your group members.", "para_2": "Communication tip: don't try to do all your communicating within a single Discussion - make separate Discussions for individual topics. The Collaborations section allows you to create a Google Doc to work on together.", "para_3": "What you must do", "para_4": "Refer to the Problem 1 & 2 given in Assignment 4 and answer the following questions.", "para_5": "The intention of the assignment is for you to learn to solve algorithmic problems, so you are encouraged to think individually first before discussing in the group.", "para_6": "You are allowed to discuss with other groups and refer to other resources, but you must cite them. ", "para_7": "If a group member contributes little or nothing, let the instructor know and they will look at the group's Files, Discussions and Collaborations to verify, and then lower that member's score as appropriate."}, "li_sentences": {"ol_0": ["For Problem 1 in assignment 4  discuss an approach to solve the problem using dynamic programming technique"], "ol_1": ["By Saturday (29th April   11:59PM PST) - make an individual post on your group page about your approach to the problem or something that's confusing you while you come up with your approach", "By Saturday (29th April   11:59PM PST) - make an individual post on your group page about your approach to the problem or something that's confusing you while you come up with your approach", "By due date - Respond to at least one of the posts made by your group members", "As a group come up a dynamic programing approach to solve the problem", "As a group write recurrence formula for your approach", "For Problem 2 in assignment 4  discuss an approach to solve the problem using backtracking technique"], "ol_2": ["By Saturday (29th April   11:59PM PST)  - Make an individual post on your group page about your approach to the problem or something that's confusing you while you come up with your approach", "By Saturday (29th April   11:59PM PST)  - Make an individual post on your group page about your approach to the problem or something that's confusing you while you come up with your approach", "By due date - Respond to at least one of the posts made by your group members", "As a group come up a backtracking approach to solve the problem"]}}, "Criteria": {"para_sentences": {"para_0": "The submitted report should answer:", "para_1": "List the names of all members of your group at the top. Once the group has finished, only one person needs to submit the pdf in Canvas on behalf of the group. (Note, you will have to submit your code individually for the Homework 4, where you will submit your implementation.)", "para_2": "Review the rubric below for grading details."}, "li_sentences": {"ol_0": ["For Problem 1 in assignment 4"], "ol_1": ["Describe a dynamic programing approach to solve the problem", "Describe a dynamic programing approach to solve the problem", "Write recurrence formula for your approach", "For Problem 2 in assignment 4"], "ol_2": ["Describe a backtracking approach to solve the problem", "Describe a backtracking approach to solve the problem"]}}, "Submission Details": {"para_sentences": {"para_0": "The Group Part must be submitted as a pdf here in Canvas."}, "li_sentences": {}}, "Evaluation": {"para_sentences": {}, "li_sentences": {"ol_0": ["For Problem 1 in assignment 4"], "ol_1": ["Describe a dynamic programing approach to solve the problem", "Describe a dynamic programing approach to solve the problem", "Write recurrence formula for your approach", "For Problem 2 in assignment 4"], "ol_2": ["Describe a backtracking approach to solve the problem", "Describe a backtracking approach to solve the problem"]}}}, "heading_sentences": ["Homework 4: Group Part"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "__asg_overview__": {"Due": "Apr 30 by \n                11:59pm", "Points": "10", "Submitting": "a file upload", "File Types": "pdf", "Available": "until May 1 at 11:59pm"}}