{"content": {"Introduction": {"para_sentences": {"para_0": "In this module, we will cover some more classic problems in dynamic programming and get a stronger grasp of the dynamic programming technique. ", "para_1": "We will also look at the introduction of another algorithms solving technique called backtracking. ", "para_2": "At the end of this module, you will be able to solve a problem using dynamic programming and analyze the time complexity of the algorithm ( CLO9 ). You will be able to define the backtracking technique and solve simple problems using this technique (CLO8).", "para_3": " ", "para_4": ""}, "li_sentences": {}}, "Module Learning Outcomes": {"para_sentences": {"para_0": "After successful completion of this module, you should be able to do the following (in addition to answering the questions listed below):"}, "li_sentences": {"ol_0": ["Solve for an optimal solution of a dynamic programming problem (CLO9)   Identify if a problem has an optimal solution vs the optimal solution? How to write an algorithm to find an optimal solution?", "Identify if a problem has an optimal solution vs the optimal solution?", "How to write an algorithm to find an optimal solution?", "Solve knapsack problems and analyze problems of similar type (CLO9)   What is a knapsack problem? How to solve an unbounded knapsack problem? How to solve a 0-1 knapsack problem?", "What is a knapsack problem?", "How to solve an unbounded knapsack problem?", "How to solve a 0-1 knapsack problem?", "Implement a backtracking algorithm for a simple problem (CLO8)   What is the backtracking technique? How to identify if a problem can be solved using the backtracking technique? What is the difference between the problems that can be solved using dynamic programming vs those that can be solved using the backtracking technique? Implement a backtracking algorithm", "What is the backtracking technique?", "How to identify if a problem can be solved using the backtracking technique?", "What is the difference between the problems that can be solved using dynamic programming vs those that can be solved using the backtracking technique?", "Implement a backtracking algorithm"]}}, "Explorations": {"para_sentences": {"para_0": "Use the pages within this module to explore the following concepts:"}, "li_sentences": {"ul_0": ["Dynamic Programming - Unbound Knapsack Problem", "Dynamic Programming - 0-1 Knapsack Problem", "Dynamic Programming - Find Optimal Solutions", "Backtracking"]}}, "Task List": {"para_sentences": {"para_0": "Please make sure to complete the following assignments and other tasks:", "para_1": "  ", "para_2": "Banner Art: Wikipedia\n\n\nLinks to an external site."}, "li_sentences": {"ul_0": ["View the explorations", "Complete the recommended but optional activities within the exploration pages", "Quiz - Dynamic Programming and Backtracking", "Homework 4: Group Part", "Homework: Dynamic Programming and Backtracking"]}}}, "heading_sentences": ["Week 4 - Overview"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ol_0": [[]], "ul_0": [[]]}, "preh2_links": {}}