{"content": {"Introduction": {"para_sentences": {"para_0": "In this module, we'll cover some interesting problems that can be solved using the backtracking technique (CLO4). We will also look into the Greedy technique to solve problems (CLO6) and prove the correctness of the solution (CLO1).", "para_1": " ", "para_2": ""}, "li_sentences": {}}, "Module Learning Outcomes": {"para_sentences": {"para_0": "After successful completion of this module, you should be able to do the following (in addition to answering the questions listed below):"}, "li_sentences": {"ol_0": ["Implement a backtracking algorithm (CLO4)   How to identify if a problem can be solved using the backtracking technique? How to implement a backtracking algorithm?", "How to identify if a problem can be solved using the backtracking technique?", "How to implement a backtracking algorithm?", "Define a Greedy technique (CLO6)   What is a Greedy algorithm technique? What are the limitations of Greedy technique? Difference between Greedy technique and Dynamic Programming Approach?", "What is a Greedy algorithm technique?", "What are the limitations of Greedy technique?", "Difference between Greedy technique and Dynamic Programming Approach?", "Implement a Greedy algorithm (CLO6)   How to implement a Greedy algorithm technique? Prove the correctness of a Greedy solution", "How to implement a Greedy algorithm technique?", "Prove the correctness of a Greedy solution"]}}, "Explorations": {"para_sentences": {"para_0": "Use the pages within this module to explore the following concepts:"}, "li_sentences": {"ul_0": ["Backtracking - N Queens Problem", "Backtracking - Combination Sum Problem", "Greedy Algorithms - Activity Selection Problem"]}}, "Task List": {"para_sentences": {"para_0": "Please make sure to complete the following assignments and other tasks:"}, "li_sentences": {"ul_0": ["View the explorations", "Complete the recommended but optional activities within the exploration pages", "Quiz - Backtracking and Greedy Algorithms", "Homework: Backtracking and Greedy Algorithms"]}}, "Proctored Exam Reminder": {"para_sentences": {"para_0": "The Midterm Exam is next week! This will be a proctored exam using  Proctorio .", "para_1": "  ", "para_2": "Banner Art: Wikipedia\n\n\nLinks to an external site."}, "li_sentences": {}}}, "heading_sentences": ["Week 5 - Overview"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ol_0": [[]], "ul_0": [[]]}, "preh2_links": {}}