{"content": {"Introduction": {"para_sentences": {"para_0": "We have seen different kinds of problems until now. In this section, we will look at those problems that have been intriguing researchers for a very long time. We will explore what these problems are called and see how to identify these problems (CLO7). We will then look at a few approximation strategies that will help us approximately solve these algorithms (CLO6).", "para_1": " ", "para_2": ""}, "li_sentences": {}}, "Module Learning Outcomes": {"para_sentences": {"para_0": "After successful completion of this module, you should be able to do the following (in addition to answering the questions listed below):"}, "li_sentences": {"ol_0": ["Explain P  NP  NP-Complete and NP-Hard complexity classes (CLO7)    What are the complexity classes? What is meant by P  NP  NP-Hard and NP-Complete? What are some examples of P  NP  NP-Complete and NP-Hard problems? What do we mean when we say a problem is NP-Complete? What do we mean by reduction?", "What are the complexity classes?", "What is meant by P  NP  NP-Hard and NP-Complete?", "What are some examples of P  NP  NP-Complete and NP-Hard problems?", "What do we mean when we say a problem is NP-Complete?", "What do we mean by reduction?", "Explain how a problem is shown to be NP-complete (CLO7)  What is meant by a reduction in polynomial time? How do we reduce one problem to another one? How do we show a problem to be NP-Complete?", "What is meant by a reduction in polynomial time?", "How do we reduce one problem to another one?", "How do we show a problem to be NP-Complete?", "Implement a polynomial-time heuristic algorithm to solve an NP-hard problem (CLO6)  What is meant by a heuristic? What is an approximation ratio? What are some strategies to implement NP-hard problems?", "What is meant by a heuristic?", "What is an approximation ratio?", "What are some strategies to implement NP-hard problems?"]}}, "Explorations": {"para_sentences": {"para_0": "Use the pages within this module to explore the following concepts:"}, "li_sentences": {"ul_0": ["P  NP  NP-Complete  NP-Hard", "NP-Completeness", "Approximation Algorithms to Solve NP-Hard Problems"]}}, "Task List": {"para_sentences": {"para_0": "Please make sure to complete the following assignments and other tasks:", "para_1": "", "para_2": "Banner Art: Wikipedia\n\n\nLinks to an external site."}, "li_sentences": {"ul_0": ["View the explorations", "Complete the recommended but optional activities within the exploration pages", "Quiz - NP-completeness and Heuristic Algorithms", "Homework 9: Group Part", "Homework: NP-Completeness and Heuristic Algorithms"]}}}, "heading_sentences": ["Week 9 - Overview"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"ol_0": [[]], "ul_0": [[]]}, "preh2_links": {}}