{"content": {"Getting ready to use Proctorio": {"para_sentences": {"para_0": "This year, OSU and Ecampus have moved to a new automated online proctoring service called Proctorio.  You will not  need to schedule proctoring appointments in Proctorio; simply go into Canvas during the exam window articulated by your instructor.  There is also no cost to you  to use automated Proctorio.", "para_1": "In this course, you will have an opportunity to test out Proctorio on a practice quiz so that you can get comfortable with the technology before you take a real exam in it.  Find a quiet, comfortable location; be prepared to use a   supported browser \n\n\nLinks to an external site. ; make sure you have a Proctorio browser extension installed; and have your school or government ID ready as you begin the practice quiz.  Proctorio will walk you through steps to verify your identity and scan your room environment, and then your session will be recorded.", "para_2": "Your security and privacy are important.  You can read more about Proctorio’s   privacy \n\n\nLinks to an external site.  and   data security \n\n\nLinks to an external site.  policies on their website.  Proctorio employees do not have access to your exam recording; rather, your instructor or TA will review it.  We also encourage you to consider disabling or deleting the Proctorio browser extension when you are not taking an exam.", "para_3": "Proctorio support is available 24/7.  In the event that you experience a technical issue during an exam, a  Proctorio “Live Chat” box should pop up. If it does not, or if you would like to reach out to Proctorio technical support, click the gray  shield icon   in your browser toolbar and select “Live chat.”  Alternatively, you can visit   Proctorio’s support page \n\n\nLinks to an external site.  and start a live chat with Proctorio customer service by clicking the “start live chat” button.", "para_4": "Please note that a functioning webcam and microphone are required for using Proctorio.   If you do not have these,   you will need to locate and submit an alternative proctor through the   exams and proctoring form   and pay for any associated proctoring fees."}, "li_sentences": {}}}, "heading_sentences": ["Start Here - Proctored Exam Info"], "__pre_h2__": {"pre_h2_para_sentences": {}, "pre_h2_li_sentences": {}}, "content_links": {"para_0": [0], "para_1": [0], "para_2": [0], "para_3": [0], "para_4": [0]}, "preh2_links": {}}